In [1]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date']) # cleaning up the job_posted_date column. Converting to datetime

In [ ]:
# .sample() to get an overview of the data
df.sample(10) # Displaying 10 random rows from the dataframe to get an overview of the data.

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
423477,Data Engineer,Data Engineer,"Sunnyvale, CA",via ZipRecruiter,Contractor,False,"California, United States",2023-07-17 16:01:36,True,False,United States,None,NaN,NaN,Tekishub Consulting Services,['python'],{'programming': ['python']}
233740,Data Engineer,Data Centre Operations Engineer,Hong Kong,via LinkedIn,Full-time,False,Hong Kong,2023-06-23 08:11:03,False,False,Hong Kong,None,NaN,NaN,Atos,"['unix', 'linux', 'windows']","{'os': ['unix', 'linux', 'windows']}"
706009,Data Engineer,Data Engineer with Python,"Wrocław, Poland",via Trabajo.org,Full-time,False,Poland,2023-03-12 03:14:38,True,False,Poland,None,NaN,NaN,Sigma IT Poland,"['scala', 'java', 'python', 'shell', 'bash', '...","{'cloud': ['aws', 'databricks'], 'libraries': ..."
502578,Cloud Engineer,Environment Engineer,"Santiago, Chile","via Trabajo.org - Vacantes De Empleo, Trabajo",Full-time,False,Chile,2023-04-16 11:47:20,False,False,Chile,None,NaN,NaN,Prysmian Group,['express'],{'webframeworks': ['express']}
646220,Data Analyst,Job in Deutschland (Köln): Data Analyst (m/f/d),"Zürich, Switzerland",via LifeworQ,Full-time,False,Switzerland,2023-12-04 12:30:37,True,False,Switzerland,None,NaN,NaN,ATP Autoteile GmbH,"['sql', 'python', 'looker']","{'analyst_tools': ['looker'], 'programming': [..."
590424,Data Engineer,Big Data Engineer,"Sydney NSW, Australia",via Trabajo.org,Full-time,False,Australia,2023-08-11 09:13:24,True,False,Australia,None,NaN,NaN,XPT Software Australia Pty Ltd,['tableau'],{'analyst_tools': ['tableau']}
301399,Software Engineer,Продуктовый аналитик,"Minsk, Belarus",via Вакансии Trabajo.org,Full-time,False,Belarus,2023-06-13 17:35:24,False,False,Belarus,None,NaN,NaN,ЛАЦИТ - Лаборатория цифровых технологий,None,None
491850,Software Engineer,IT Analyst 1,"George Town, Penang, Malaysia",via BeBee Malaysia,Full-time,False,Malaysia,2023-02-16 11:27:26,False,False,Malaysia,None,NaN,NaN,AMD,"['sap', 'excel', 'powerpoint', 'word']","{'analyst_tools': ['sap', 'excel', 'powerpoint..."
330479,Senior Data Analyst,Senior Data Analyst (Upto 60M),"Hanoi, Hoàn Kiếm, Hanoi, Vietnam",via Joboko,Full-time,False,Vietnam,2023-06-27 23:43:00,False,False,Vietnam,None,NaN,NaN,Công ty cổ phần Synodus,"['sql', 'python', 'r', 'hadoop', 'tableau', 'p...","{'analyst_tools': ['tableau', 'power bi'], 'li..."
357647,Business Analyst,Business Analyst,"Prague, Czechia",via Trabajo.org,Full-time,False,Czechia,2023-10-18 23:29:54,False,False,Czechia,None,NaN,NaN,"DATA, DIGITAL & IT",None,None

In [ ]:
# .sample() to get an overview of the data with reproducibility
df.sample(10, random_state=42) # Displaying 10 random rows from the dataframe to get an overview of the data. Setting random_state for reproducibility.

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
502901,Senior Data Engineer,Senior Data Engineer,"St Paul, MN",via BeBee,Full-time,False,"Florida, United States",2023-12-17 11:09:06,False,False,United States,None,NaN,NaN,ManpowerGroup,"['sql', 'azure', 'git']","{'cloud': ['azure'], 'other': ['git'], 'progra..."
406337,Senior Data Scientist,Senior Analytics Engineer,"London, UK",via LinkedIn,Full-time,False,United Kingdom,2023-10-06 16:09:56,False,False,United Kingdom,None,NaN,NaN,Harnham,"['sql', 'python', 'bigquery', 'snowflake', 'lo...","{'analyst_tools': ['looker'], 'cloud': ['bigqu..."
659951,Data Engineer,Data Engineer,"Newcastle upon Tyne, UK",via Indeed,Full-time,False,United Kingdom,2023-09-06 10:11:25,True,False,United Kingdom,None,NaN,NaN,Morgan King,None,None
541593,Data Analyst,Data Analyst,Malta,via Trabajo.org,Full-time,False,Malta,2023-02-14 21:14:18,True,False,Malta,None,NaN,NaN,Konnekt,['jira'],{'async': ['jira']}
425158,Senior Data Engineer,Senior Data Engineer. Job in Amsterdam NBC4i Jobs,"Amsterdam, Netherlands",via NBC4i Jobs,Full-time,False,Netherlands,2023-06-19 16:34:30,True,False,Netherlands,None,NaN,NaN,Independent Recruiters,['python'],{'programming': ['python']}
183426,Data Analyst,Data Analyst,Singapore,via Singapore | JobsDB,Full-time,False,Singapore,2023-11-09 16:07:57,False,False,Singapore,None,NaN,NaN,FLEXOSENSE PTE. LTD.,"['r', 'python', 'java', 'sql', 'sql server', '...","{'analyst_tools': ['tableau'], 'cloud': ['orac..."
287790,Data Analyst,Data Analyst,"Tampa, FL",via LinkedIn,Full-time,False,"Florida, United States",2023-07-14 17:02:23,True,False,United States,None,NaN,NaN,Iris Software Inc.,"['sql', 'hadoop', 'excel']","{'analyst_tools': ['excel'], 'libraries': ['ha..."
541983,Data Analyst,"Data Analyst, Cloud Systems Jobs","Chantilly, VA",via Clearance Jobs,Full-time,False,Georgia,2023-06-15 19:44:34,False,False,United States,None,NaN,NaN,SAIC,"['sql', 'r', 'matlab', 'python', 'oracle', 'aw...","{'analyst_tools': ['power bi', 'tableau', 'qli..."
416896,Data Scientist,Alternant Actuariat & Data Science H/F,France,via LinkedIn,Full-time,False,France,2023-09-22 16:47:24,False,False,France,None,NaN,NaN,KPMG France,None,None
780907,Data Engineer,"Data Engineer with Fivetran,Qlik Must","Mexico City, CDMX, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-16 06:19:09,False,False,Mexico,None,NaN,NaN,CORUS Consulting,"['oracle', 'snowflake', 'aws', 'azure', 'alter...","{'analyst_tools': ['alteryx'], 'cloud': ['orac..."

# .copy()

In [ ]:
# .copy() Make a copy of object's indices and data. It essentially creates a copy of the dataframe.

# Make a new dataframe and load the data into it.
dataset = load_dataset('lukebarousse/data_jobs')
df_original = dataset['train'].to_pandas()

In [10]:
df_altered = df_original.copy() # Creating a copy of the original dataframe to preserve the original data.

In [12]:
df_altered.loc[:5, 'salary_year_avg']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: salary_year_avg, dtype: float64

In [ ]:
# Calculate the median salary and set equal to a variable, median_salary
median_salary = df['salary_year_avg'].median() # Calculating the median salary from the salary_year_avg column.

median_salary

115000.0

In [15]:
# Fill in the null values in that column with the median_salary variable

df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median_salary) # Filling in the null values in the salary_year_avg column with the median_salary variable.

df_altered.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [ ]:
# The original gets updated just as the original dateframe did.
df_altered.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [17]:
# Return the identity of the original dataframe to show it has not changed
id(df_original)

2683981080144

In [18]:
id(df_altered)

2684014127696

In [19]:
id(df_original) == id(df_altered)

False

In [20]:
dataset = load_dataset('lukebarousse/data_jobs')
df_original = dataset['train'].to_pandas()

In [21]:
df_altered = df_original.copy() # Creating a copy of the original dataframe to preserve the original data.

In [22]:
print('ID of df_original:', id(df_original))
print('ID of df_altered:', id(df_altered))
print('Are both IDs the same?', id(df_original) == id(df_altered))

ID of df_original: 2684315740432
ID of df_altered: 2684014062160
Are both IDs the same? False

In [23]:
median_salary = df_altered['salary_year_avg'].median()

df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median_salary)

df_altered.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [24]:
df_original.loc[:5, 'salary_year_avg']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: salary_year_avg, dtype: float64